{
    "Projects": {
        "Roost": {
            "Title": "<h2><a href=\"https://roost-app.herokuapp.com/\" target=\"_blank\">Roost</a></h2>",
            "Image": "<img src=\"media/images/roost_image.png\" alt=\"Roost\">",
            "Description": "<p>Roost is a video hosting website where users can upload short videos to store and share with others via link. Users can create accounts to upload videos and can share links to those videos or links to their own accounts. A sample video can be seen <a href=\"https://roost-app.herokuapp.com/viewer?_id=6862e2abe2efb3acce13f8b8\">here</a>. The application is built using <a href=\"https://www.heroku.com/\">Heroku</a> to host a Node JS server. The web application utilizes <a href=\"https://react.dev/\">React</a> to display its components and <a href=\"https://redis.io/\">Redis</a> for account-related purposes. Additionally, the application uses <a href=\"https://www.mongodb.com/\">MongoDB</a> as a database for the server.</p>"
        },
        "Steel Heel Jam": {
            "Title": "<h2>Steel Heel Jam: <a href=\"https://nickybakes.itch.io/steel-heel-jam\" target=\"_blank\">Game Page</a></h2>",
            "Image": "<iframe class=\"trailer\" width=\"900\" height=\"500\" src=\"https://www.youtube.com/embed/oy4JxydzyLc\" title=\"Steel Heel Jam Trailer\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>",
            "Description": "<p>Steel Heel Jam is a 2-8-player 3D platform fighter where players must compete to stay within a closing ring. The project was developed using the Unity game engine. The game has multiple weapons that can be picked up, used, and thrown at opponents. There are many ways to fight in this game. You can attack, jump attack, roll, block throw objects, and even perform a massive suplex slam. Once a player is outside of the ring with no stamina, they are eliminated. The last player standing is the winner. The game is currently available on <a href=\"https://itch.io/\" target=\"_blank\">itch.io</a></p>"
        },
        "Best Cars Dealership": {
            "Title": "<h2><a href=\"https://github.com/JoshIQui/best-cars-dealership/\" target=\"_blank\">Best Cars Dealership</a></h2>",
            "Image": "<img src=\"media/images/best_cars_dealership_image.png\" alt=\"Best Cars Dealership\">",
            "Description": "<p>Best Cars Dealership is a capstone project for the IBM Full Stack Developer Certification. It features a web application utilizing <a href=\"https://react.dev/\">React</a> and NodeJS to maintain a frontend and backend. The application is containerized using docker and deployed on Kubernetes, making a full stack application. On the application, users can search for car dealerships and leave reviews, all stored on a MongoDB database.</p>"
        },
        "3DRenderer": {
            "Title": "<h2>3DRenderer: <a href=\"https://github.com/JoshIQui/3DRenderer\" target=\"_blank\">Github</a></h2>",
            "Image": "<img src=\"media/images/3drenderer.png\" alt=\"3D Renderer\">",
            "Description": "<p>3DRenderer is a simple 3D renderer created in C++ using DirectX 11. The project features a game where the player collects cubes by jumping into them. The graphics, material system, physics, collision, and all other aspects of the game engine were programmed from the ground up with a few external helper classes.</p>"
        },
        "Plant Shopper": {
            "Title": "<h2><a href=\"https://joshiqui.github.io/e-plantShopping/\" target=\"_blank\">Plant Shopper</a></h2>",
            "Image": "<img src=\"media/images/plant_shopper_image.png\" alt=\"Plant Shopper\">",
            "Description": "<p>Plant shopper is a shopping interface created with React utilizing Redux. Built off a template, I created the React and Redux systems to engineer the frontend. The user can add items to their cart, remove items, and adjust the amount per unique items. The cart page calculates the amount for each item as well as the total price. You can follow the link to play with the frontend. The project is hosted and ported on github pages.</p>"
        },
        "Hitboxle": {
            "Title": "<h2><a href=\"https://hitboxle.herokuapp.com/\" target=\"_blank\">Hitboxle</a></h2>",
            "Image": "<img src=\"media/images/hitboxle_image.png\" alt=\"Hitboxle\">",
            "Description": "<p>Hitboxle is a Wordle-inspired web game where the player will guess the name of the character that owns the specified fighting game move. The player is given a description of the move along with some useful frame data information. Once the user guesses the correct character name, the answer is revealed. At any point, a user can change the puzzle that is presented for sampling purposes. The application is built as a <a href=\"https://www.heroku.com/\">Heroku</a>-hosted Node JS server. The application manages requests for puzzle information and to update user statistics. Move information is borrowed from <a href=\"https://www.dustloop.com/w/Main_Page\">Dustloop</a> and stored in a JSON file on the server. The server can then use this file to decide on what puzzle to use for the specified time-slot.</p>"
        },
        "Zelda Finder": {
            "Title": "<h2><a href=\"https://people.rit.edu/jiq4449/330/project-1/app.html\" target=\"_blank\">Zelda Finder</a></h2>",
            "Image": "<img src=\"media/images/zelda_finder_image.PNG\" alt=\"Zelda Finder\">",
            "Description": "<p>Zelda Finder is a search engine that allows a user to search for Zelda-related games, characters, monsters, bosses, dungeons, places, and items. The app utilizes html, css, javascript, and JSON to manage the searches and provide results. The app also utilizes local storage manipulation and <a href=\"https://firebase.google.com/\">Firebase</a> to maintain user data. For example, the app has a favorite option which allows the user to mark results that they like. The app will remember that the user favorited them and will also increase that result's favorite count in the community page. The app utilizes the <a href=\"https://zelda.fanapis.com/\">Zelda API</a> to query and return results. The app also uses <a href=\"https://bulma.io/\"> Bulma</a> for styling and is streamlined using Javascript Web Components.</p>"
        },
        "Life Visualizer": {
            "Title": "<h2><a href=\"https://people.rit.edu/jiq4449/330/project-2/app.html\" target=\"_blank\">Life Visualizer</a></h2>",
            "Image": "<img src=\"media/images/life_visualizer_image.PNG\" alt=\"Life Visualizer\">",
            "Description": "<p>The Live Visualizer is an audio visualizer that utilizes both the Canvas API and a personally-made JavaScript version of Conway's Game of Life to generate visual effects from music. The project is written using HTML, CSS, and JavaScript. Additionally the project utilizes <a href=\"https://bulma.io/\">Bulma</a> to create a responsive UI. The user can select from different visual filters and songs. The audio is adjustable via a slider and the user is capable of selecting from three songs. The user is also capable of creating their own color for the visualizer through three different color sliders. There are controls for audio in the form of checkboxes that the user can fill to affect the audio.</p>"
        },
        "Amiibo Finder": {
            "Title": "<h2><a href=\"media/projects/amiibo_finder/\" target=\"_blank\">Amiibo Finder</a></h2>",
            "Image": "<img src=\"media/images/amiibo_finder_image.PNG\" alt=\"Amiibo Finder\">",
            "Description": "<p>Amiibo Finder is a project that uses html, css and javascript to create a search engine that returns a list of amiibos that meet the criteria. To do this, the program utilizes the <a href=\"https://www.amiiboapi.com/\">AmiiboAPI</a> to generate results. The user could search using the amiibo's name, game series, amiibo series and could even filter by date. The user could also select what store they wanted a link to be from so that they could buy their searched ammibo at their desired store. This project was done entirely by myself, with criticism from classmates to assist in the creation process. The main learning point of this project was to understand how to get external information and parse it. As a result, the main challenge of this project was finding a way to parse the information clearly and efficiently.</p>"
        }
    },
    "Work Experience": {
        "Changeling VR - Game Developer": {
            "Title": "<h2><a href=\"https://www.changelingvr.com/\" target=\"_blank\">Changeling VR</a>: Game Developer</h2>",
            "Image": "<iframe class=\"trailer\" width=\"900\" height=\"500\" src=\"https://www.youtube.com/embed/B01VZdgthws?si=Uqzr1B85CPcYfvNu\" title=\"ChangelingVR | Teaser Trailer\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>",
            "Description": "<p>As a Game Developer for Changeling VR, I had the opportunity to lead a team in the development of multiple levels of our VR, first-person, interactive, mystery game, Changeling. Managing my team in a Scrum enviromnent, I led focused efforts in design, planning, and development utilizing Unreal Engine 4. As an experienced user of Unreal Engine, I heavily contributed to the technical planning and architecture of our responsible project aspects as well as the onboarding of members who were less experienced in Unreal Engine. The game, which is available on <a href=\"https://changelingvrteam.itch.io/changelingvr\">itch.io</a>, free to download and play.</p>"
        },
        "AVEVA - Front End Angular Developer Intern": {
            "Title": "<h2><a href=\"https://www.aveva.com/en/\" target=\"_blank\">AVEVA</a>: Front End Angular Developer Intern</h2>",
            "Image": "<img src=\"media/images/AVEVA_insight_image.png\" alt=\"Aveva Insight\">",
            "Description": "<p>Working as a Front End Angular Developer Intern at AVEVA, I contributed to the <a href=\"https://www.aveva.com/en/products/insight/\">AVEVA Insight</a> project: a web application for the visualization and analysis of Operations, Assets, and Overall Equipment Effectiveness (OEE). Utilizing <a href=\"https://angular.dev/\">Angular</a>, Typescript and a host of other web application-focused languages, I contributed to the development of frontend systems and widgets. Additionally, utilizing <a href=\"https://azure.microsoft.com/en-us/products/devops\">Azure DevOps</a> and <a href=\"https://www.cypress.io/\">Cypress</a>, I created and uniformized unit tests across the entire project. Maintaining, developing, and debugging code responsible for communicating with backend systems, were the primary bulk of my contributions, even performing some contribution to the application's backend.</p>"
        }
    },
    "Professional Certifications": {
        "AWS Certified Solutions Architect - Associate": {
            "Title": "<h2><a href=\"https://www.credly.com/badges/d6582ae3-824a-4336-b07f-6a3a7b32290b/public_url\" target=\"_blank\">AWS Certified Solutions Architect – Associate</a></h2>",
            "Image": "<img src=\"media/images/aws_certified_solutions_architect_associate.png\" alt=\"AWS Certification Badge\">",
            "Description": "<p>After taking a rigorous exam from AWS, this certification certifies that I am a capable solutions architect for AWS services and technologies. I am able to build \"well-architected distributed systems that are scalable, resilient, efficient, and fault-tolerant.\"</p>"
        },
        "IBM Full Stack Software Developer": {
            "Title": "<h2><a href=\"media/pdfs/IBM_full_stack_software_developer.pdf\" target=\"_blank\">IBM Full Stack Software Developer</a></h2>",
            "Image": "<img src=\"media/images/IBM_full_stack_software_developer.png\" alt=\"AWS Certification Badge\">",
            "Description": "<p>After several months of IBM provided coursework, I am certified by the company as a Full Stack Software Developer. I have taken courses and performed coursework in cloud technologies, web technologies, SQL/NoSQL, containerization, and more. My certification culminated in a capstone project: a complete. containerized web application.</p>"
        }
    }
}